Repository: mozilla-l10n/mt-training-data
Catalog: ig/ig_pontoon.tmx
Source language: en_us
Languages: ig

source: Please keep the length of your message to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ig: Biko dowe ogologo nke ozi gị ka ọ bụrụ mkpụrụedemede %(limit_value)s ma ọ bụ pekarịa. Ugbu a ọ bụ mkpụrụedemede %(show_value)s.

source: Please keep the length of your question to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ig: Biko dowe ogologo nke aha ajụjụ gị ka ọ bụrụ mkpụrụedemede %(limit_value)s ma ọ bụ pekarịa. Ọ bụ mkpụrụedemede %(show_value)s ugbu a.

source: Please keep the length of your title to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ig: Biko dowe ogologo nke aha gị ka ọ bụrụ mkpụrụedemede %(limit_value)s ma ọ bụ pekarịa. Ọ bụ mkpụrụedemede %(show_value)s ugbu a.

source: Please note that these selections are specific to the current product selected.
ig: Biko mara na nhọpụta ndị a bụ nke ngwaọrụ dị ugbu ahọpụtara.

source: Please note that you will be subscribed to these notifications for all products. If you are only interested in specific products, please go to the dashboard for that product.
ig: Biko mara na a ga-edebanye gị na amamọkwa ndị a maka ngwaahịa niile. Ọ bụrụ na ị nwere mmasị n'ụfọdụ ngwaahịa, biko gaa na ogwe maka ngwaahịa ahụ.

source: Please provide a description.
ig: Biko nye nkọwapụta.

source: Please provide a message.
ig: Biko nye otu ozi.

source: Please provide an email.
ig: Biko nye email.

source: Please provide an email address and we'll send you an alert.
ig: Biko nye adreesị email, anyị ga-ezitere gị nkute.

source: Please provide a question.
ig: Biko nye ajụjụ.

source: Please provide a slug.
ig: Biko nye slọg.

source: Please provide a subject.
ig: Biko nye isiokwu.

source: Please provide a summary.
ig: Biko nye nchịkọta.

source: Please provide a tag.
ig: Biko nye mkpado.

source: Please provide a title.
ig: Biko nye aha.

source: Please provide content.
ig: Biko nye ọdịnaya.

source: Please provide more details
ig: Biko nyekwuo nkọwapụta

source: Please provide the Transaction ID.
ig: Biko nye ID Azụmahịa.

source: Please review the latest revision.
ig: Biko nyochaa ngụgharị kachasị ọhụrụ.

source: Please review the latest version.
ig: Biko nyochaa ụdị kachasị ọhụrụ.

source: Please select...
ig: Biko họrọ...

source: Please select a category from the previous column or start a search.
ig: Biko họrọ otu site n'ọgbara ikpeazụ ma ọ bụ bido ọchụchọ.

source: Please select a different title.
ig: Biko họrọ aha dị iche.

source: Please select an image or video to insert.
ig: Biko họrọ onyonyo ma ọ bụ vidio a ga-afanye.

source: Please select at least one product.
ig: Biko họrọ opekata mpe otu ngwaahịa.

source: Please select at least one topic.
ig: Biko họrọ opekata mpe otu isiokwu.

source: Please type in your username to confirm
ig: Biko pịnye aha njirimara gị iji kwenye

source: Please upload an image with one of the following extensions: jpg, jpeg, png, gif.
ig: Biko bugoo onyonyo nwere otu n'ime ndọtị ndị a: jpg, png, gif.

source: Please visit the <a href="https://www.paypal.com/cgi-bin/helpweb?cmd=_help"> Paypal Help Center</a>.
ig: Biko gaa na <a href="https://www.paypal.com/cgi-bin/helpweb?cmd=_help"> Ama Enyemaka Paypal</a>.

source: Please visit the Marketplace page for the application. There you can find the developers' contact information and contact them directly.
ig: Biko gaa na ibe Ọdụ ahịa maka akwụkwọ anamachọihe ahụ. Ebe ahụ ị nwere ike ịchọta ozi mkpọtụrụ nke ndị nrụpụta ahụ ma kpọtụrụ ha ozugbo.

source: Please wait...
ig: Biko chere...

source: Portions of this content are &copy;1998–2015 <br>by individual mozilla.org contributors. Content <br>available under a <a href="//www.mozilla.org/foundation/licensing/website-content.html">Creative Commons license</a>.
ig: Ụfọdụ akụkụ nke ọdịnaya a bụ &copy;1998–2015 <br>nke ndị nkwado mozilla.org iche iche. Ọdịnaya <br>dị n'okpuru <a href="//www.mozilla.org/foundation/licensing/website-content.html">ikikere Creative Commons</a>.

source: post
ig: bisa

source: Post a new thread
ig: Bisa usoro ọhụrụ

source: Post a question
ig: Bisa ajụjụ

source: Post a reply
ig: Bisa nzaghachi

source: Post a Reply
ig: Bisa Nzaghachi

source: Post contains
ig: Mbisa nwere

source: Posted
ig: Ebisara

source: posted by
ig: ebisara site n'aka

source: Post Preview:
ig: Bisa Nhụchalụ:

source: Post Question
ig: Bisa Ajụjụ

source: Post Reply
ig: Bisa Nzaghachi

source: Posts from everyone
ig: Mbisa site n'aka mmadụ niile

source: Post Thread
ig: Bisa Usoro

source: Preferred language
ig: Asụsụ amasịrị

source: Preview
ig: Hụchalụ

source: Preview Changes
ig: Hụchalụ Mgbanwe

source: Preview Content
ig: Hụchalụ Ọdịnaya

source: Preview Reply
ig: Hụchalụ Nzaghachi

source: previous
ig: ikpeazụ

source: Previous
ig: Ikpeazụ

source: Privacy and security
ig: Nzuzo na nche

source: Privacy and Security
ig: Nzuzo na Nche

source: Privacy and security settings
ig: Ntọala nzuzo na nche

source: Private message
ig: Ozi nzuzo

source: Private Message
ig: Ozi Nkeonwe

source: Problems with add-ons, plugins or unwanted software
ig: Nsogbu na mgbakwunye, nkwụnye ma ọ bụ ngwanrọ achọghị

source: Problems with websites
ig: Nsogbu na weebụsaịtị

source: Problems with websites that don't work well in Firefox for Windows 8 Touch.
ig: Nsogbu na weebụsaịtị na anaghị arụ ọrụ nke ọma na Firefox maka Windows 8 Touch.

source: Procedures to diagnose and fix problems
ig: Ụkpụrụ iji chọpụta ma dozie nsogbu

source: Product
ig: Ngwaahịa

source: {product} Help
ig: Enyemaka {product}

source: [{product}] Knowledge Base Dashboard
ig: Ogwe Ọdụ Nghọta [{product}]

source: Products
ig: Ngwaahịa

source: {product} Support Forum
ig: {product} Ọgbakọ Nkwado

source: Protect your information with Firefox's privacy settings on iOS
ig: Chedo ozi gị site na iji ntọala nzuzo nke Firefox na iOS

source: Protect your privacy
ig: Chedo nzuzo gị

source: Provide a brief description of this media.
ig: Nye obere nkọwa nke mgbasa ozi a.

source: Provide more details
ig: Nyekwuo nkọwapụta

source: <p> SUMO is now using Gravatars as avatars. You must change your Gravatar on gravatar.com. </p> <p> It can take a few minutes for the avatar change to take effect. You may need to wait a few minutes and reload the page to see your new Gravatar. </p>
ig: <p> SUMO na eji Gravatars dị ka nghọrọ. Ị ga-agbanwerịrị Gravatar gị na gravatar.com. </p> <p> Ọ nwere ike iwe nkeji ole ma ole maka mgbanwe nghọrọ ahụ ịdọnye. Ị ga-echere nkeji ole ma ole wee dọnyegharịa ibe ahụ iji hụ Gravatar ọhụrụ gị. </p>

source: <p>This article may be out of date.</p> <p> An important change has been made to the English article on which this is based. Until this page is updated, you might find this helpful: <a href="%(url)s">%(title)s</a> </p>
ig: <p>Edemede a nwere ike ịme ochie.</p> <p> Emere mgbanwe dị mkpa na edemede Bekee ahụ bụ ndabere nke a. Ruo mgbe emelitere ibe a, nke a nwere ike ịbaara gị uru: <a href="%(url)s">%(title)s</a> </p>

source: {q} | {product} Support Forum
ig: {q} | {product} Ọgbakọ Nkwado

source: Question
ig: Ajụjụ

source: Question:
ig: Ajụjụ:

source: Question date
ig: Ụbọchị ajụjụ

source: Question details
ig: Nkọwa ajụjụ

source: Question owner
ig: Jụọ onye nwe ya ajụjụ

source: Questions
ig: Ajụjụ

source: Questions responded to within X hours
ig: Ajụjụ ndị azaghachiri n'ime aka elekere X

source: Questions solved
ig: Ajụjụ ndị asara

source: Question tools
ig: Ngwaọrụ ajụjụ

source: Quickstart Guide
ig: Nduzi Mmalite Ọsọ Ọsọ

source: Quote
ig: Nkwupute

source: Quote previous message...
ig: Kwupute ozi ikpeazụ...

source: Read and save web pages in a clutter-free, reader-friendly view
ig: Gụọ ma chekwaa ibe weebụ na nlele na agbagwojughi anya, dị mfe ọgụgụ

source: Reader View and List
ig: Nlele na Ndepụta Agụmịhe

source: Readied for localization:
ig: Akwadobere maka ntụgharị asụsụ:

source: Readied for localization by:
ig: Akwadobere maka ntụgharị asụsụ site n'aka:

source: Read message
ig: Gụọ ozi

source: Read Message
ig: Gụọ Ozi

source: read more
ig: gụkwuo

source: Read, send and organize emails
ig: Gụọ, zipu ma hazie email

source: Read Sent Message
ig: Gụọ Ozi Ezipuru

source: Read this answer in context
ig: Gụọ azịza a na nghọta

source: Read this for some help to get started
ig: Gụọ nke a maka ụfọdụ enyemaka iji bido

source: Ready for localization
ig: Njikere maka ntụgharị asụsụ

source: Ready for localization:
ig: Njikere maka ntụgharị asụsụ:

source: Recent answers to %s
ig: Azịza nso nso maka %s

source: Recent awardees
ig: Ndị nrite nso nso a

source: Recent English Changes
ig: Mgbanwe Bekee Nso Nso A

source: Recently approved updates
ig: Mmemme ndị akwadoro nso nso a

source: Recently Awarded
ig: Enyere Nso Nso A

source: Recently awarded badges
ig: Akara ndị enyere nso nso a

source: Recently unanswered
ig: Nke azaghị nso nso a

source: Recently updated questions
ig: Ajụjụ ndị emelitere nso nso a

source: Recently updated questions tagged %s
ig: Akpadoro ajụjụ ndị emelitere nso nso a %s

source: Recently updated threads about %s
ig: Emelitere usoro nso nso a gbasara %s

source: Recent posts in %s
ig: Mbisa nso nso a na %s

source: Recent Revisions
ig: Ngụgharị Nso Nso

source: [Recursive inclusion of "%s"]
ig: [Ngụnye mmegharị nke "%s"]

source: (Redirected from <a href="{href}">{title}</a>)
ig: (Ebugharịrị site na <a href="{href}">{title}</a>)

source: Redirecting
ig: Na ebugharị

source: Redirects
ig: Mbugharị

source: Re: {forum} - {thread}
ig: Za: {forum} - {thread}

source: Refresh Firefox
ig: Tighachi Firefox

source: Regards, <br />The SUMO team.
ig: Ekele, <br />Otu SUMO.

source: Regards, The SUMO team
ig: Ekele, otu SUMO

source: Register or sign in
ig: Debanye aha ma ọ bụ banye

source: Register or Sign In
ig: Debanye aha ma ọ bụ Banye

source: Register to be a Contributor
ig: Debanye aha ịbụ Onye Nkwado

source: registration profile
ig: profaịlụ ndebanye

source: registration profiles
ig: profaịlụ ndebanye

source: Rejected
ig: Ajụrụ

source: Related
ig: Emetụtara

source: Related documents:
ig: Hichapụ Dọkụmentị:

source: Related products
ig: Ngwaahịa ndị eyitere

source: Related to the Lightning add-on for Calendar
ig: Metụtara mgbanwe Ịcha Ọkụ maka Kalịnda

source: Release Notes
ig: Ndetu Mbupute

source: Relevance
ig: Mkpa

source: Relevant to
ig: Dị mkpa na

source: Relevant to:
ig: Dị mkpa na:

source: Remove contributor
ig: Wepu onye nkwado

source: Remove Contributor
ig: Wepu Onye Nkwado

source: Remove contributor | {document}
ig: Wepu onye nkwado | {document}

source: Remove leader
ig: Wepu onye isi

source: Remove member
ig: Wepu onye otu

source: Remove {role}
ig: Wepu {role}

source: Remove tweets that aren't really about Firefox or don't need a reply
ig: Wepu twiit ndị na abụghị maka Firefox ma ọ bụ ndị ekwesịghị ịzaghachi

source: Remove user from contributors
ig: Wepu onye ọrụ na ndị nkwado

source: Remove user from group
ig: Wepu onye ọrụ n'otu

source: Remove user from leaders
ig: Wepu onye ọrụ na ndị isi

source: Remove user from locale editors
ig: Wepu onye ọrụ na ndị ndezi mpaghara

source: Remove user from locale leaders
ig: Wepu onye ọrụ na ndị isi mpaghara

source: Remove user from locale reviewers
ig: Wepu onye ọrụ na ndị nyocha mpaghara

source: Replies
ig: Nzaghachi

source: reply
ig: nzaghachinzaghachi

source: Reply
ig: Zaghachi

source: Reply...
ig: Zaghachi...

source: Reply Preview
ig: Nhụchalụ Nzaghachi

source: Reply-to is empty
ig: Zaghachi-na ghe oghe

source: Reply to thread: {title}
ig: Zaghachi usoro: {title}

source: Report this
ig: Kpesa nke a

source: Request type not recognized.
ig: Amataghị ụdị arịrịọ.

source: Required. 30 characters or fewer. Letters, digits and ./- only.
ig: Achọrọ: mkpụrụedemede 30 ma ọ bụ pekarịa. Mkpụrụedemede, mkpụrụọnụọgụ na naanị ./-.

source: Re: %s
ig: Za: %s

source: Resend account confirmation email
ig: Zipugharịa email nkwenye akaụntụ

source: Resend confirmation email
ig: Zipugharịa email nkwenye

source: Responded
ig: Azaghachiri

source: % Responded in 24 hours
ig: % Zaghachiri na aka elekere 24

source: Responded in 24 hours
ig: Zaghachiri na aka elekere 24

source: % Responded in 72 hours
ig: % Zaghachiri na aka elekere 72

source: Responded in 72 hours
ig: Zaghachiri na aka elekere 72

source: Respond to the tweet!
ig: Zaghachi twiit!

source: Response editor
ig: Ihe ndezi nzaghachi

source: Response preview
ig: Nhụchalụ nzaghachi

source: Responses
ig: Nzaghachi

source: Results
ig: Nsonaazụ

source: Results for: {query}
ig: Nsonaazụ maka: {query}

source: Retrieve username
ig: Weghachite aha njirimara

source: Retrieve Username
ig: Weghachite Aha Njirimara

source: Reveal password to check that it's right
ig: Kpughepu okwuntughe iji lelee na o ziri ezi

source: Reviewed
ig: Enyochara

source: Reviewed:
ig: Enyochara:

source: Reviewed by:
ig: Enyochara n'aka:

source: %(reviewer)s has approved the revision to the document %(document_title)s.
ig: %(reviewer)s akwadola ngụgharị maka dọkụmentị %(document_title)s.

source: %(reviewer)s has approved your revision to the document %(document_title)s.
ig: %(reviewer)s akwadola ngụgharị gị maka dọkụmentị %(document_title)s.

source: %(reviewer)s has reviewed your revision to the document %(document_title)s.
ig: %(reviewer)s enyochaala ngụgharị gị maka dọkụmentị %(document_title)s.

source: Reviewing Revision {id} by {user}
ig: Na-enyocha Ngụgharị {id} site n'aka {user}

source: Reviewing Translation {id} in {language} by {user}
ig: Na-enyocha Ntụgharị Asụsụ {id} na {language} site n'aka {user}

source: Review Needed
ig: Achọrọ Nyocha

source: Review Needed: {comment}
ig: Achọrọ Nyocha: {comment}

source: Review Process
ig: Ụkpụrụ Nyocha

source: Review Revision
ig: Nyochaa Ngụgharị

source: Review Revision {id} | {document}
ig: Nyochaa Ngụgharị {id} | {document}

source: Review Revision of {title}
ig: Nyochaa Ngụgharị nke {title}

source: [Reviews Pending: %s] SUMO needs your help!
ig: [Nyocha Na Eche: %s] SUMO chọrọ enyemaka gị!

source: Review this revision
ig: Nyochaa ngụgharị a

source: Review Translation
ig: Nyochaa Ntụgharị Asụsụ

source: Review Translation {id} | {document}
ig: Nyochaa Ntụgharị Asụsụ {id} | {document}

source: Review Translation of {title}
ig: Nyochaa Ntụgharị Asụsụ nke {title}

source: Revision
ig: Ngụgharị

source: Revision Comment: {comment}
ig: Asịsa Ngụgharị: {comment}

source: Revision Content
ig: Ọdịnaya Ngụgharị

source: Revision History | {document}
ig: Ndekọ Ngụgharị | {document}

source: Revision history for:
ig: Ndekọ ngụgharị maka:

source: Revision id:
ig: ID ngụgharị:

source: Revision {id} by {user} on {date}
ig: Ngụgharị {id} nke {user} na {date}

source: Revision Information
ig: Ozi Ngụgharị

source: Revision {n} | {t} | {c}
ig: Ngụgharị {n} | {t} | {c}

source: Revision {num}
ig: Ngụgharị {num}

source: Revision {num}:
ig: Ngụgharị {num}:

source: Revision rendered html:
ig: Enyere ngụgharị html:

source: Revision %s
ig: Ngụgharị %s

source: Revision source:
ig: Isi mmalite ngụgharị:

source: Revision Source
ig: Isi Mmalite Ngụgharị

source: said
ig: kwuru

source: salt
ig: nnu

source: Save changes
ig: Chekwaa mgbanwe

source: Save description
ig: Chekwaa nkọwapụta

source: Save image
ig: Chekwaa onyonyo

source: Save Question
ig: Chekwaa Ajụjụ

source: Save, share and sync
ig: Chekwaa, kekọrịta ma mekọrịta

source: Save, share and synchronize content with other devices
ig: Chekwaa, kekọrịta ma mekọrịta ọdịnaya yana ngwaọrụ ndị ọzọ

source: Save the world
ig: Zọpụta ụwa

source: Save the world from the comfort of your couch
ig: Zọpụta ụwa site na ọmarịcha ọnọdụ nke oche gị

source: %s characters remaining
ig: Mkpụrụedemede %s fọdụrụ

source: Search and navigate easily with these essential features
ig: Chọọ ma gagharịa na enweghị nhịahụ site na iji atụmatụ ndị a dị mkpa

source: Search Clickthrough Rate
ig: Chọọ Ogo Mpịfere

source: Search for a user...
ig: Chọọ onye ọrụ...

source: Search for common responses
ig: Chọọ nzaghachi ndị a na enwekarị

source: Search for documents...
ig: Chọọ dọkụmentị...

source: Search Gallery
ig: Chọọ N'ime Ọba

source: Search in forum
ig: Chọọ n'ọgbakọ

source: Search is temporarily unavailable. Please try again in a few minutes.
ig: Ọchụchọ pụrụ ntakịrị oge. Biko nwaa ọzọ na nkeji ole ma ole.

source: Search Mozilla Support
ig: Chọọ Nkwado Mozilla

source: Search results summary:
ig: Chọọ nchịkọta nsonaazụ:

source: Search result summary:
ig: Chọọ nchịkọta nsonaazụ:

source: Search result summary in {locale}:
ig: Chọọ nchịkọta nsonaazụ na {locale}:

source: Search the Discussion Forums
ig: Chọọ n'ime Ọgbakọ Mkparịta Ụka

source: Search the Knowledge Base
ig: Chọọ n'ime Ọdụ Nghọta

source: Search the Mozilla Support Knowledge Base and Support Forum.
ig: Chọọ Ọdụ Nghọta Nkwado Mozilla yana Ọgbakọ Nkwado.

source: Search the Support Questions
ig: Chọọ n'ime Ajụjụ Nkwado

source: Search Unavailable
ig: Ọchụchọ Adịghị

source: See <a href="%(url)s">the history</a> to base your edit on an existing unreviewed revision.
ig: Hụ <a href="%(url)s">ndekọ</a> iji dowe ndezi gị na ngụgharị enyochabeghị dị adị.

source: See All
ig: Hụ Dum

source: See all available SUMO badges
ig: Hụ akara SUMO niile dị

source: See all the details:
ig: Hụ nkọwapụta ahụ niile:

source: See all the details...
ig: Hu nkọwapụta ahụ niile...

source: See also:
ig: Hụ Dum:

source: See the comment:
ig: Hụ asịsa ahụ:

source: See the data
ig: Hụ data ahụ

source: See what you can do to help
ig: Hụ ihe nwere ike ịme iji nyere aka

source: See your question here:
ig: Hụ ajụjụ gị ebe a:

source: Select a language to translate to:
ig: Họrọ asụsụ iji tụgharịa ka ọ bụrụ:

source: Select by Locale
ig: Jiri Mpaghara họrọ

source: Select language
ig: Họrọ asụsụ

source: Select language | {document}
ig: Họrọ asụsụ | {document}

source: Seller will not provide support
ig: Onye na ere ahịa agaghị enye nkwado

source: Send
ig: Zipu

source: Send emails for private messages
ig: Zipu email maka ozi nzuzo

source: {sender} sent you the following message:
ig: {sender} zitere gị ozi ndị a:

source: Send password reset link
ig: Zipu njikọ ntọgharị okwuntughe

source: Send Updates
ig: Zipu Mmelite

source: Send username
ig: Zipu aha njirimara

source: Sensible Settings
ig: Ntọala Amamịghe

source: Sent Message
ig: Ozi Ezipuru

source: Sent Messages
ig: Ozi Ndị Ezipuru

source: Setting a date and time on your Firefox OS phone
ig: Ịtọ ụbọchị na oge na ekwentị Firefox OS gị

source: Set up email
ig: Tọlite email

source: Share Data
ig: Kekọrịta Data

source: Share this article: {link}
ig: Kekọrịta edemede a: {link}

source: Share web pages on Firefox for iOS
ig: Kekọrịta ibe weebụ na Firefox maka iOS

source: Share your wisdom with the world.
ig: Kekọrịta amamịghe gị n'etiti mmadụ niile.

source: Show:
ig: Gosi:

source: Show after
ig: Gosi emechaa

source: Show All
ig: Gosi Dum

source: Show all questions
ig: Gosi ajụjụ niile

source: Show details &raquo;
ig: Gosi nkọwa &raquo;

source: Show Everything
ig: Gosi Ihe Niile

source: Show Helpfulness Votes Chart
ig: Gosi Chaatị Ntuli Aka Ịba Uru

source: Show History
ig: Gosi Ndekọ

source: Show information for:
ig: Gosi ozi maka:

source: Showing questions tagged:
ig: Na egosi ajụjụ ndị akpadoro:

source: Show less
ig: Gosi obere

source: Show me
ig: Gosi m

source: Show media for:
ig: Gosi mgbasa ozi maka:

source: Show more
ig: Gosikwuo

source: Show translations
ig: Gosi ntụgharị asụsụ

source: Show Translations
ig: Gosi Ntụgharị Asụsụ

source: Show translations | {document}
ig: Gosi ntụgharị asụsụ | {document}

source: Show until
ig: Gosi ruo

source: Signed in!
ig: Abanyere!

source: Significance:
ig: Mkpa:

source: Significance - MT: Major Content Changes. M: Content Changes. Empty: Minor Changes.
ig: Mkpa - MT: Isi Mgbanwe Ọdịnaya. Mgbanwe Ọdịnaya. Ghe oghe: Obere Mgbanwe.

source: Sign in and connect to Twitter
ig: Banye ma jikọọ na Twitter

source: Signing in...
ig: Na-abanye...

source: Sign in to Mozilla Support
ig: Banye na Nkwado Mozilla

source: Sign out
ig: Pụọ

source: Sign up as a volunteer
ig: Debanye aha dị ka onye mwepụta onwe

source: "%s" is too large (%sKB), the limit is %sKB
ig: "%s" buru oke ibu (%sKB), oke ahụ bụ %sKB

source: Sit back and relax. Our forum contributors will get back to you with an answer.
ig: Tukwuru ala zuo oke. Ndị nkwado ọgbakọ anyị ga-ezitere gị azịza.

source: {sitename} Password Reset
ig: Ntọgharị Okwuntughe {sitename}

source: Sites Affected
ig: Saịtị Ndị Emetụtara

source: Skip to main content
ig: Mafere na isi ọdịnaya

source: Skip to search
ig: Mafere na ọchụchọ

source: Slowness or hanging
ig: Ọdụdọ ma ọ bụ nkwụdo

source: Slug:
ig: Slọg:

source: Slug in {locale}:
ig: Slọg na {locale}:

source: solution
ig: asịsa

source: Solution chosen
ig: Asịsa ahọpụtara

source: Solution chosen by {user}
ig: {user} họpụtara asịsa a

source: Solution didn't work
ig: Asịsa arụghị ọrụ

source: Solution found for question: %s
ig: Ahụrụ asịsa maka ajụjụ: %s

source: Solution found to Firefox Help question
ig: Ahụrụ asịsa maka ajụjụ Enyemaka Firefox

source: Solution provided
ig: Enyere asịsa

source: solved
ig: asaala ya

source: Solved
ig: Asara ya

source: % Solved
ig: Asaala %

source: Solved the problem
ig: Kpeziri nsogbu ahụ

source: Solves the problem
ig: Na ekpezi nsogbu ahụ

source: Solving 1 issue helps up to 1,000 users a day
ig: Imezi 1 nsogbu na enyere ruo ndị ọrụ 1,000 n'otu ụbọchị

source: Solving 1 issue helps up to 1,000 users a day!
ig: Ikpezi 1 nsogbu na enyere ruo ndị ọrụ 1,000 n'otu ụbọchị!

source: Some features on this page are temporarily disabled while we perform website maintenance. Please try again a little later.
ig: Agbanyụrụ ụfọdụ atụmatụ ntakịrị oge ka anyị mezie weebụsaịtị. Biko jiri bọtịnụ Azụ nke ihe nchọgharị gị wee nwaa ọzọ n'obere oge.

source: Some text will appear in the empty box.
ig: Ụfọdụ ederede ga-egosi n'igbe ghe oghe.

source: Something is wrong
ig: Ọnweghị ihe na adịghị mma

source: Sorry! Search is currently unavailable. Please try again soon.
ig: Ndo! Ọchụchọ adịghị ugbu a. Biko nwaa ọzọ n'oge adịghị anya.

source: Sorry to hear that.
ig: Ndo maka nke ahụ.

source: Sorry, we couldn't find the page you were looking for. Please, try searching our site using the form below.
ig: Ndo, anyị enwenwughi ike ịchọta ibe ị na achọ. Biko, nwaa ịchọ n'ime saịtị anyị site na iji mpempe akwụkwọ ahụ dị n'okpuru.

source: Sort options
ig: Nhọrọ nhọcha

source: Sort results by
ig: Họchaa nsonaazụ site na

source: Source Code
ig: Koodu Isi Mmalite

source: Spam or other unrelated content
ig: Adịgboroja ma ọ bụ ọdịnaya ndị ọzọ na enweghị mmetụta

source: <span class="key">Accessibility</span>: No
ig: <span class="key">Nnweta</span>: Mba

source: <span class="key">Accessibility</span>: Yes
ig: <span class="key">Nnweta</span>: Ee

source: <span class="key">User JS</span>: No
ig: <span class="key">Onye ọrụ JS</span>: Mba

source: <span class="key">User JS</span>: Yes
ig: <span class="key">Onye ọrụ JS</span>: Ee

source: %s posted an answer to your question "%s"
ig: %s bisara azịza na ajụjụ gị "%s"

source: Stale
ig: Ochie

source: Start
ig: Mbido

source: Start:
ig: Mbido:

source: Start answering!
ig: Bido ịza ajụjụ!

source: Status
ig: Ọkwa

source: Stay in touch
ig: Na akpọtụrụ anyị

source: Stay up to date with news feeds, blogs and social features
ig: Mara ihe na eme site na iji atụmatụ ngụpụta akụkọ, blọọgụ na mmekọrịta

source: Sticky
ig: Nyado

source: Sticky this thread
ig: Nyado usoro a

source: Stop article emails
ig: Kwụsị email edemede

source: Stop email updates
ig: Kwụsị mmelite email

source: Stop Ignoring
ig: Kwụsị Nleghara Anya

source: Stop receiving updates via email for this question.
ig: Kwụsị ịnweta mmelite site na email maka ajụjụ a.

source: Stop watching this forum
ig: Kwụsị ịlele ọgbakọ a

source: Stop watching this locale
ig: Kwụsị ịlele mpaghara a
